## Terraform Plan Output for prod
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # azurerm_container_registry.acr will be destroyed
  # (because azurerm_container_registry.acr is not in configuration)
  - resource "azurerm_container_registry" "acr" {
      - admin_enabled                 = false -> null
      - anonymous_pull_enabled        = false -> null
      - data_endpoint_enabled         = false -> null
      - encryption                    = [] -> null
      - export_policy_enabled         = true -> null
      - id                            = "/subscriptions/431fca8d-e614-4268-aa3c-22a2e684933a/resourceGroups/cst8918-final-project-group-2/providers/Microsoft.ContainerRegistry/registries/cst8918finalprojectacr" -> null
      - location                      = "canadacentral" -> null
      - login_server                  = "cst8918finalprojectacr.azurecr.io" -> null
      - name                          = "cst8918finalprojectacr" -> null
      - network_rule_bypass_option    = "AzureServices" -> null
      - network_rule_set              = [] -> null
      - public_network_access_enabled = true -> null
      - quarantine_policy_enabled     = false -> null
      - resource_group_name           = "cst8918-final-project-group-2" -> null
      - retention_policy_in_days      = 0 -> null
      - sku                           = "Basic" -> null
      - tags                          = {} -> null
      - trust_policy_enabled          = false -> null
      - zone_redundancy_enabled       = false -> null
    }

  # azurerm_resource_group.main_rg will be destroyed
  # (because azurerm_resource_group.main_rg is not in configuration)
  - resource "azurerm_resource_group" "main_rg" {
      - id       = "/subscriptions/431fca8d-e614-4268-aa3c-22a2e684933a/resourceGroups/cst8918-final-project-group-2" -> null
      - location = "canadacentral" -> null
      - name     = "cst8918-final-project-group-2" -> null
      - tags     = {} -> null
    }

  # module.aks.azurerm_kubernetes_cluster.aks will be created
  + resource "azurerm_kubernetes_cluster" "aks" {
      + cost_analysis_enabled               = true
      + current_kubernetes_version          = (known after apply)
      + dns_prefix                          = "prod-aks"
      + fqdn                                = (known after apply)
      + http_application_routing_zone_name  = (known after apply)
      + id                                  = (known after apply)
      + kube_admin_config                   = (sensitive value)
      + kube_admin_config_raw               = (sensitive value)
      + kube_config                         = (sensitive value)
      + kube_config_raw                     = (sensitive value)
      + kubernetes_version                  = (known after apply)
      + location                            = "canadacentral"
      + name                                = "prod-aks"
      + node_os_upgrade_channel             = "NodeImage"
      + node_resource_group                 = (known after apply)
      + node_resource_group_id              = (known after apply)
      + oidc_issuer_url                     = (known after apply)
      + portal_fqdn                         = (known after apply)
      + private_cluster_enabled             = false
      + private_cluster_public_fqdn_enabled = false
      + private_dns_zone_id                 = (known after apply)
      + private_fqdn                        = (known after apply)
      + resource_group_name                 = "cst8918-final-project-group-2"
      + role_based_access_control_enabled   = true
      + run_command_enabled                 = true
      + sku_tier                            = "Standard"
      + support_plan                        = "KubernetesOfficial"
      + tags                                = {
          + "environment" = "test"
        }
      + workload_identity_enabled           = false

      + default_node_pool {
          + auto_scaling_enabled = true
          + kubelet_disk_type    = (known after apply)
          + max_count            = 3
          + max_pods             = (known after apply)
          + min_count            = 1
          + name                 = "masterpool"
          + node_count           = 1
          + node_labels          = (known after apply)
          + orchestrator_version = (known after apply)
          + os_disk_size_gb      = (known after apply)
          + os_disk_type         = "Managed"
          + os_sku               = (known after apply)
          + scale_down_mode      = "Delete"
          + type                 = "VirtualMachineScaleSets"
          + ultra_ssd_enabled    = false
          + vm_size              = "Standard_B2s"
          + vnet_subnet_id       = "/subscriptions/431fca8d-e614-4268-aa3c-22a2e684933a/resourceGroups/cst8918-final-project-group-2/providers/Microsoft.Network/virtualNetworks/cst8918-final-project-vnet/subnets/cst8918-final-project-prod-subnet"
          + workload_runtime     = (known after apply)
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + network_profile {
          + dns_service_ip     = (known after apply)
          + ip_versions        = (known after apply)
          + load_balancer_sku  = "standard"
          + network_data_plane = "azure"
          + network_mode       = (known after apply)
          + network_plugin     = "kubenet"
          + network_policy     = (known after apply)
          + outbound_type      = "loadBalancer"
          + pod_cidr           = (known after apply)
          + pod_cidrs          = (known after apply)
          + service_cidr       = (known after apply)
          + service_cidrs      = (known after apply)
        }
    }

  # module.network.azurerm_subnet.admin will be destroyed
  # (because azurerm_subnet.admin is not in configuration)
  - resource "azurerm_subnet" "admin" {
      - address_prefixes                              = [
          - "10.3.0.0/16",
        ] -> null
      - default_outbound_access_enabled               = true -> null
      - id                                            = "/subscriptions/431fca8d-e614-4268-aa3c-22a2e684933a/resourceGroups/cst8918-final-project-group-2/providers/Microsoft.Network/virtualNetworks/cst8918-final-project-vnet/subnets/cst8918-final-project-admin-subnet" -> null
      - name                                          = "cst8918-final-project-admin-subnet" -> null
      - private_endpoint_network_policies             = "Disabled" -> null
      - private_link_service_network_policies_enabled = true -> null
      - resource_group_name                           = "cst8918-final-project-group-2" -> null
      - service_endpoint_policy_ids                   = [] -> null
      - service_endpoints                             = [] -> null
      - virtual_network_name                          = "cst8918-final-project-vnet" -> null
    }

  # module.network.azurerm_subnet.dev will be destroyed
  # (because azurerm_subnet.dev is not in configuration)
  - resource "azurerm_subnet" "dev" {
      - address_prefixes                              = [
          - "10.2.0.0/16",
        ] -> null
      - default_outbound_access_enabled               = true -> null
      - id                                            = "/subscriptions/431fca8d-e614-4268-aa3c-22a2e684933a/resourceGroups/cst8918-final-project-group-2/providers/Microsoft.Network/virtualNetworks/cst8918-final-project-vnet/subnets/cst8918-final-project-dev-subnet" -> null
      - name                                          = "cst8918-final-project-dev-subnet" -> null
      - private_endpoint_network_policies             = "Disabled" -> null
      - private_link_service_network_policies_enabled = true -> null
      - resource_group_name                           = "cst8918-final-project-group-2" -> null
      - service_endpoint_policy_ids                   = [] -> null
      - service_endpoints                             = [] -> null
      - virtual_network_name                          = "cst8918-final-project-vnet" -> null
    }

  # module.network.azurerm_subnet.prod will be destroyed
  # (because azurerm_subnet.prod is not in configuration)
  - resource "azurerm_subnet" "prod" {
      - address_prefixes                              = [
          - "10.0.0.0/16",
        ] -> null
      - default_outbound_access_enabled               = true -> null
      - id                                            = "/subscriptions/431fca8d-e614-4268-aa3c-22a2e684933a/resourceGroups/cst8918-final-project-group-2/providers/Microsoft.Network/virtualNetworks/cst8918-final-project-vnet/subnets/cst8918-final-project-prod-subnet" -> null
      - name                                          = "cst8918-final-project-prod-subnet" -> null
      - private_endpoint_network_policies             = "Disabled" -> null
      - private_link_service_network_policies_enabled = true -> null
      - resource_group_name                           = "cst8918-final-project-group-2" -> null
      - service_endpoint_policy_ids                   = [] -> null
      - service_endpoints                             = [] -> null
      - virtual_network_name                          = "cst8918-final-project-vnet" -> null
    }

  # module.network.azurerm_subnet.test will be destroyed
  # (because azurerm_subnet.test is not in configuration)
  - resource "azurerm_subnet" "test" {
      - address_prefixes                              = [
          - "10.1.0.0/16",
        ] -> null
      - default_outbound_access_enabled               = true -> null
      - id                                            = "/subscriptions/431fca8d-e614-4268-aa3c-22a2e684933a/resourceGroups/cst8918-final-project-group-2/providers/Microsoft.Network/virtualNetworks/cst8918-final-project-vnet/subnets/cst8918-final-project-test-subnet" -> null
      - name                                          = "cst8918-final-project-test-subnet" -> null
      - private_endpoint_network_policies             = "Disabled" -> null
      - private_link_service_network_policies_enabled = true -> null
      - resource_group_name                           = "cst8918-final-project-group-2" -> null
      - service_endpoint_policy_ids                   = [] -> null
      - service_endpoints                             = [] -> null
      - virtual_network_name                          = "cst8918-final-project-vnet" -> null
    }

  # module.network.azurerm_virtual_network.main will be destroyed
  # (because azurerm_virtual_network.main is not in configuration)
  - resource "azurerm_virtual_network" "main" {
      - address_space                  = [
          - "10.0.0.0/14",
        ] -> null
      - dns_servers                    = [] -> null
      - flow_timeout_in_minutes        = 0 -> null
      - guid                           = "a20ea29d-a2ec-4bc3-8e99-4f1aab5f4413" -> null
      - id                             = "/subscriptions/431fca8d-e614-4268-aa3c-22a2e684933a/resourceGroups/cst8918-final-project-group-2/providers/Microsoft.Network/virtualNetworks/cst8918-final-project-vnet" -> null
      - location                       = "canadacentral" -> null
      - name                           = "cst8918-final-project-vnet" -> null
      - private_endpoint_vnet_policies = "Disabled" -> null
      - resource_group_name            = "cst8918-final-project-group-2" -> null
      - subnet                         = [
          - {
              - address_prefixes                              = [
                  - "10.0.0.0/16",
                ]
              - default_outbound_access_enabled               = true
              - delegation                                    = []
              - id                                            = "/subscriptions/431fca8d-e614-4268-aa3c-22a2e684933a/resourceGroups/cst8918-final-project-group-2/providers/Microsoft.Network/virtualNetworks/cst8918-final-project-vnet/subnets/cst8918-final-project-prod-subnet"
              - name                                          = "cst8918-final-project-prod-subnet"
              - private_endpoint_network_policies             = "Disabled"
              - private_link_service_network_policies_enabled = true
              - route_table_id                                = ""
              - security_group                                = ""
              - service_endpoint_policy_ids                   = []
              - service_endpoints                             = []
            },
          - {
              - address_prefixes                              = [
                  - "10.1.0.0/16",
                ]
              - default_outbound_access_enabled               = true
              - delegation                                    = []
              - id                                            = "/subscriptions/431fca8d-e614-4268-aa3c-22a2e684933a/resourceGroups/cst8918-final-project-group-2/providers/Microsoft.Network/virtualNetworks/cst8918-final-project-vnet/subnets/cst8918-final-project-test-subnet"
              - name                                          = "cst8918-final-project-test-subnet"
              - private_endpoint_network_policies             = "Disabled"
              - private_link_service_network_policies_enabled = true
              - route_table_id                                = ""
              - security_group                                = ""
              - service_endpoint_policy_ids                   = []
              - service_endpoints                             = []
            },
          - {
              - address_prefixes                              = [
                  - "10.2.0.0/16",
                ]
              - default_outbound_access_enabled               = true
              - delegation                                    = []
              - id                                            = "/subscriptions/431fca8d-e614-4268-aa3c-22a2e684933a/resourceGroups/cst8918-final-project-group-2/providers/Microsoft.Network/virtualNetworks/cst8918-final-project-vnet/subnets/cst8918-final-project-dev-subnet"
              - name                                          = "cst8918-final-project-dev-subnet"
              - private_endpoint_network_policies             = "Disabled"
              - private_link_service_network_policies_enabled = true
              - route_table_id                                = ""
              - security_group                                = ""
              - service_endpoint_policy_ids                   = []
              - service_endpoints                             = []
            },
          - {
              - address_prefixes                              = [
                  - "10.3.0.0/16",
                ]
              - default_outbound_access_enabled               = true
              - delegation                                    = []
              - id                                            = "/subscriptions/431fca8d-e614-4268-aa3c-22a2e684933a/resourceGroups/cst8918-final-project-group-2/providers/Microsoft.Network/virtualNetworks/cst8918-final-project-vnet/subnets/cst8918-final-project-admin-subnet"
              - name                                          = "cst8918-final-project-admin-subnet"
              - private_endpoint_network_policies             = "Disabled"
              - private_link_service_network_policies_enabled = true
              - route_table_id                                = ""
              - security_group                                = ""
              - service_endpoint_policy_ids                   = []
              - service_endpoints                             = []
            },
        ] -> null
      - tags                           = {} -> null
    }

Plan: 1 to add, 0 to change, 7 to destroy.

Changes to Outputs:
  - resource_group_name = "cst8918-final-project-group-2" -> null
```
</details>